Revit 2027 API
CanExecuteEventArgs.IsChecked Property
The value that indicates whether the UI associated with the Command associated with this event is in a checked state.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsChecked { get; set; }
Public Property IsChecked As Boolean
	Get
	Set
public:
property bool IsChecked {
	bool get ();
	void set (bool value);
}
member IsChecked : bool with get, set
Property Value
Boolean
See Also
Reference
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace